{
  "activation_dropout": 0.1,
  "apply_spec_augment": true,
  "architectures": [
    "SpeechT5ForTextToSpeech"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "conv_bias": false,
  "conv_dim": [
    512,
    512,
    512,
    512,
    512,
    512,
    512
  ],
  "conv_kernel": [
    10,
    3,
    3,
    3,
    3,
    2,
    2
  ],
  "conv_stride": [
    5,
    2,
    2,
    2,
    2,
    2,
    2
  ],
  "decoder_attention_heads": 4,
  "decoder_ffn_dim": 1024,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 6,
  "decoder_start_token_id": 2,
  "encoder_attention_heads": 4,
  "encoder_ffn_dim": 1024,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 12,
  "encoder_max_relative_position": 160,
  "eos_token_id": 2,
  "feat_extract_activation": "gelu",
  "feat_extract_norm": "group",
  "feat_proj_dropout": 0.0,
  "guided_attention_loss_num_heads": 2,
  "guided_attention_loss_scale": 10.0,
  "guided_attention_loss_sigma": 0.4,
  "hidden_act": "gelu",
  "hidden_dropout": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "is_encoder_decoder": true,
  "layer_norm_eps": 1e-05,
  "mask_feature_length": 10,
  "mask_feature_min_masks": 0,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_min_masks": 2,
  "mask_time_prob": 0.05,
  "max_speech_positions": 1876,
  "max_text_positions": 600,
  "model_type": "speecht5",
  "num_conv_pos_embedding_groups": 16,
  "num_conv_pos_embeddings": 128,
  "num_feat_extract_layers": 7,
  "num_mel_bins": 80,
  "pad_token_id": 0,
  "positional_dropout": 0.1,
  "reduction_factor": 2,
  "scale_embedding": false,
  "speaker_embedding_dim": 128,
  "speech_decoder_postnet_dropout": 0.5,
  "speech_decoder_postnet_kernel": 5,
  "speech_decoder_postnet_layers": 5,
  "speech_decoder_postnet_units": 256,
  "speech_decoder_prenet_dropout": 0.5,
  "speech_decoder_prenet_layers": 2,
  "speech_decoder_prenet_units": 256,
  "torch_dtype": "float32",
  "transformers_version": "4.29.0.dev0",
  "use_cache": true,
  "use_guided_attention_loss": true,
  "vocab_size": 392
}